{
    "_general": "Karlo's Observatory Console - v1.0\nType 'help [command]' for more information on a specific command.\n<br>",
    "help": {
        "description": "Provides help information for console commands.",
        "usage": "help [command]",
        "details": "Displays a list of all available commands. If a command is specified, it shows detailed information for that command."
    },
    "boids": {
        "description": "A flocking simulation based on Craig Reynolds' Boids algorithm.",
        "usage": "boids [-b|--boids N] [-s|--separation N] [-a|--alignment N] [-c|--cohesion N]",
        "details": "Simulates the collective motion of a group of boids. The simulation can be customized with the following options:\n\n  -b, --boids       [int]    The desired number of boids to simulate (Default: 1024)\n  -s, --separation  [float]  Strength of the force to avoid crowding (Default: 0.01)\n  -a, --alignment   [float]  Strength of the force to steer towards the average flock direction (Default: 0.015)\n  -c, --cohesion    [float]  Strength of the force to steer towards the center of the flock (Default: 0.6)\n\nUse your mouse to apply a repulsive force to the boids."
    },
    "gameoflife": {
        "description": "Conway's Game of Life, a cellular automaton.",
        "usage": "gameoflife",
        "details": "A zero-player game where the evolution of the system is determined by its initial state. Click or drag on the grid to draw living cells."
    },
    "evoltree": {
        "description": "A simulation of evolutionary branching.",
        "usage": "evoltree",
        "details": "Visualizes how species can diverge over time through reproduction and mutation. Organisms that are too similar or too far apart die out."
    },
    "mandelbrot": {
        "description": "An interactive visualization of the Mandelbrot set.",
        "usage": "mandelbrot",
        "details": "A fractal viewer. Use the mouse wheel or pinch-to-zoom to explore. Click and drag to pan."
    },
    "gravitysim": {
        "description": "A particle-based N-body gravity simulation.",
        "usage": "gravitysim",
        "details": "Simulates a galaxy of particles interacting under a simplified gravity model. The mouse acts as a massive 'sun' that attracts particles."
    },
    "glideroflife": {
        "description": "A survival game based on Conway's Game of Life.",
        "usage": "glideroflife",
        "details": "Control a single glider with the arrow keys. Navigate the grid to collect food for points while avoiding disruption by other 'wild' cells. Collecting food increases the game speed and spawns more wild cells."
    }
}